app/Controllers/Company.php

SELECT *
FROM `companies`
ORDER BY `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `companies`
---
    public function index()
    {
        $model = new CompaniesModel();

        $data = [
            'companies' => $model->orderBy('id', 'DESC')->paginate(5),
            'pager' => $model->pager
        ];

SELECT *
FROM `companies`
WHERE `id` = '6'
 LIMIT 1
---
    public function edit($id = 0)
    {
        $model = new CompaniesModel();

        $company = $model->where('id', $id)->first();

UPDATE `companies` SET `name` = 'Emrpesa de prueba 2', `address` = 'Dirección de prueba 2', `phone` = '7892-8793', `nit` = '8983-948394-839-4', `nrc` = '732873-8', `business_line` = 'Compra y Venta', `legal_representative` = 'Cindy Rodriguez'
WHERE `companies`.`id` IN ('7')
---
                'legal_representative' => $this->request->getVar('legal_representative')
            ];

            $company->update($id, $data);